{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_6", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "filters": 96, "kernel_size": [11, 11], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 256, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-06, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["acc"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [96], "dtype": "float32", "quantization": {"min": 1.0004956722259521, "scale": 3.174426508884804e-05, "dtype": "uint8"}}, {"name": "batch_normalization_5/beta", "shape": [96], "dtype": "float32", "quantization": {"min": -0.0027085105422884224, "scale": 2.2384384647011756e-05, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_mean", "shape": [96], "dtype": "float32", "quantization": {"min": 0.00010443406063131988, "scale": 0.001789905951819474, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_variance", "shape": [96], "dtype": "float32", "quantization": {"min": 1.7629561170906527e-06, "scale": 0.00012689103916683036, "dtype": "uint8"}}, {"name": "conv2d_21/kernel", "shape": [11, 11, 3, 96], "dtype": "float32", "quantization": {"min": -0.02562713436051911, "scale": 0.00020021198719155555, "dtype": "uint8"}}, {"name": "conv2d_21/bias", "shape": [96], "dtype": "float32", "quantization": {"min": -0.0014380000549934658, "scale": 2.4793104396439066e-05, "dtype": "uint8"}}, {"name": "conv2d_22/kernel", "shape": [5, 5, 96, 256], "dtype": "float32", "quantization": {"min": -0.030760145479557563, "scale": 0.00024220586991777608, "dtype": "uint8"}}, {"name": "conv2d_22/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.0009496901001708181, "scale": 1.695875178876461e-05, "dtype": "uint8"}}, {"name": "conv2d_23/kernel", "shape": [3, 3, 256, 384], "dtype": "float32", "quantization": {"min": -0.03623128533363342, "scale": 0.00028528571128845216, "dtype": "uint8"}}, {"name": "conv2d_23/bias", "shape": [384], "dtype": "float32", "quantization": {"min": -0.0016580980453713267, "scale": 2.181707954435956e-05, "dtype": "uint8"}}, {"name": "conv2d_24/kernel", "shape": [3, 3, 384, 384], "dtype": "float32", "quantization": {"min": -0.035855740191889744, "scale": 0.000289159195095885, "dtype": "uint8"}}, {"name": "conv2d_24/bias", "shape": [384], "dtype": "float32", "quantization": {"min": -0.0011442602447727147, "scale": 1.4860522659385906e-05, "dtype": "uint8"}}, {"name": "conv2d_25/kernel", "shape": [3, 3, 384, 256], "dtype": "float32", "quantization": {"min": -0.037352057239588565, "scale": 0.0002964448987268934, "dtype": "uint8"}}, {"name": "conv2d_25/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.0015174158209679174, "scale": 1.7644370011254853e-05, "dtype": "uint8"}}, {"name": "dense_13/kernel", "shape": [1024, 4096], "dtype": "float32", "quantization": {"min": -0.03832445717325397, "scale": 0.0003065956573860318, "dtype": "uint8"}}, {"name": "dense_13/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.0017475695148402568, "scale": 2.131182335171045e-05, "dtype": "uint8"}}, {"name": "dense_14/kernel", "shape": [4096, 4096], "dtype": "float32", "quantization": {"min": -0.030243333845454103, "scale": 0.00023813648697207956, "dtype": "uint8"}}, {"name": "dense_14/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.0018171739887774866, "scale": 1.835529281593421e-05, "dtype": "uint8"}}, {"name": "dense_15/kernel", "shape": [4096, 13], "dtype": "float32", "quantization": {"min": -0.040063589373055625, "scale": 0.000317964995024251, "dtype": "uint8"}}, {"name": "dense_15/bias", "shape": [13], "dtype": "float32", "quantization": {"min": -0.0007295517935691511, "scale": 1.2799154273143001e-05, "dtype": "uint8"}}]}]}